import logging
from abc import ABC, abstractmethod
import re

from app.utils.types import IsoCode

logger = logging.getLogger(__name__)
digits_re = r"\d+[.,]?\d*"
valuts_re = [
    r"(?:австралийский доллар|A\$|AUD)",  # $
    # r"(?азербайджанский манат|ман|₼|AZN)", # manat, ₼ - не обрабатывается
    r"(?:фунт(?:ами|ов|а|у|ом|) стерлингов|£|GBP)",
    r"(?:драм(?:ами|ов|а|у|ом|)|֏|AMD)",
    r"(?:белорусский рубль|Br|BYN)",  # rub
    r"(?:лев|лв|BGN)",
    r"(?:реал(?:ами|ов|а|у|ом|)|R\$|BRL)",
    r"(?:форинт(?:ами|ов|а|у|ом|)|ƒ|HUF)",
    r"(?:гонконгский доллар|HK\$|HKD)",  # $
    r"(?:(?:датск(?:ая|ую|ой|ую|ие|их|ими) )крона|дат.kr|DKK)",  # krona
    r"(?:доллар(?:ами|ов|ы|у|ом|а|)|бакс(?:ами|ов|а|у|ом|)|\$|USD)",  # $
    r"(?:евро|€|EUR)",
    r"(?:(?:индийск(?:ая|ую|ой|ую|ие|их|ими) )рупи(?:ями|й|ю|ей|и|ях|я)|₹|INR)",  # рупия
    r"(?:тенге|тңг|₸|KZT)",
    r"(?:канадский доллар|C\$|CAD)",  # $
    r"(?:сом(?:ами|ов|а|у|ом|)|KGS)",
    r"(?:юан(?:ями|й|ю|ей|ь|ях|я)|кит.¥|CNY)",
    r"(?:молдавский лей|молд.L|MDL)",
    r"(?:(?:норвежск(?:ая|ую|ой|ую|ие|их|ими) )крона|норв.kr|NOK)",  # krona
    r"(?:злоты(?:й|х)|zł|PLN)",
    r"(?:румынский лей|рум.L|RON)",
    r"(?:сингапурский доллар|S\$|SGD)",  # $
    r"(?:сомони|смн.|TJS)",
    r"(?:лир(?:ами|у|ы|ой|а|)|₺|TRY)",
    r"(?:туркменский манат|туркм.m|TMT)",  # manat
    r"(?:сум(?:ами|ов|ы|у|ом|а|е|ах|)|сўм|UZS)",
    r"(?:грив(?:нами|ны|не|ну|ной|на|ен)|грн|₴|UAH)",
    r"(?:(?:чешск(?:ая|ую|ой|ую|ие|их|ими) )?крон(?:ами|ы|е|у|ой|а|)|кч|Kč|CZK)",  # krona
    r"(?:(?:шведск(?:ая|ую|ой|ую|ие|их|ими) )крона|шв.kr|SEK)",  # krona
    r"(?:франк(?:ами|ов|а|у|ом|)|₣|CHF)",
    r"(?:ренд|ZAR)",
    r"(?:вон(?:ами|ы|е|у|ой|а|)|₩|KRW)",
    r"(?:иен(?:ами|ы|е|у|ой|а|)|яп.¥|JPY)",
    r"(?:рубл(?:ями|и|ем|ю|ей|я|ь)|руб|₽|RUB)",  # rub
    r"(?:шекел(?:ями|и|ем|ю|ей|я|ь)|NIS|₪|ILS)",
    r"(?:(?:сейшельск(?:ая|ую|ой|ую|ие|их|ими) )?рупи(?:ями|й|ю|ей|е|и|ям|ях|я)|sc|Re|SCR)",  # рупия
    r"(?:дирхам(?:ами|ов|а|у|ом|)|Dh|AED)",
]


# TODO разобраться с регулярками здесь. нужно чтобы "2 евроспорт" не считалось а "*,2.8бакса?" считалось
#  таким образом надо думать о том, что разрешены знаки препинания после ключевых символов или слов, но не буквы
class Rates(ABC):
    digits_reg = re.compile(digits_re)  # цифры, десятичная точка и снова цифры
    valuts = {
        val[-4:-1]: re.compile(
            r"(" + digits_re + r")\s*" + val + r"(?=[\r\n\t\f\v .,:;!?&]|$)",
            flags=re.IGNORECASE
        )
        for val in valuts_re
    }
    vault_dollar_reg2 = re.compile(r"\$(\d+[.,]?\d*)(?=[\r\n\t\f\v .,:;!?&]|$)")
    val_chars = {
        "AUD": "A$",
        "AZN": "₼",
        "GBP": "£",
        "AMD": "֏",
        "BYN": "Br",
        "BGN": "лв",
        "BRL": "R$",
        "HUF": "ƒ",
        "HKD": "HK$",
        "DKK": "дат.kr",
        "USD": "$",
        "EUR": "€",
        "INR": "₹",
        "KZT": "₸",
        "CAD": "C$",
        "KGS": "сом",
        "CNY": "кит.¥",
        "MDL": "молд.L",
        "NOK": "норв.kr",
        "PLN": "zł",
        "RON": "рум.L",
        "SGD": "S$",
        "TJS": "смн.",
        "TRY": "₺",
        "TMT": "туркм.m",
        "UZS": "сўм",
        "UAH": "₴",
        "CZK": "Kč",
        "SEK": "шв.kr",
        "CHF": "₣",
        "ZAR": "ренд",
        "KRW": "₩",
        "JPY": "яп.¥",
        "RUB": "₽",
        "ILS": "₪",
        "SCR": " SCR",
        "AED": "Dh"
    }

    def __init__(self):
        logger.info(f'init {self.get_source_rates()}')

    @abstractmethod
    def get_rate(self, val_char: IsoCode):
        pass

    @abstractmethod
    def get_updated_date(self):
        pass

    @abstractmethod
    def get_source_rates(self):
        pass

    source_rates = property(get_source_rates)
